app/controllers/sub_reddits_controller.rb

SELECT  "sub_reddits".* FROM "sub_reddits" WHERE "sub_reddits"."slug" = ? LIMIT 1  [["slug", "1"]]
---
	def show_by_slug
		slug = params[:slug]
		begin
			@sub_reddit = SubReddit.find_by(slug: slug)